---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationPartPlacementUtils
source: html/111daded-a96e-e967-d70c-54e2c12c2d96.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartPlacementUtils

General utility placement methods in the Autodesk Revit MEP product for fabrication.

## Syntax (C#)
```csharp
public static class FabricationPartPlacementUtils
```